-- MySQL dump 10.13  Distrib 8.0.41, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: web_education_bd
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `events`
--

DROP TABLE IF EXISTS `events`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `events` (
  `event_id` int NOT NULL AUTO_INCREMENT,
  `supervisor_id` int DEFAULT NULL,
  `event_name` varchar(255) NOT NULL,
  `event_date` datetime NOT NULL,
  `event_description` text,
  `venue` varchar(255) DEFAULT NULL,
  `event_type` enum('Лекція','Практика','Семінар','Конференція','Дедлайн','Виставка','Екзамен','Зустріч','Інше') NOT NULL,
  `duration` int DEFAULT NULL,
  PRIMARY KEY (`event_id`),
  KEY `supervisor_id` (`supervisor_id`),
  CONSTRAINT `events_ibfk_1` FOREIGN KEY (`supervisor_id`) REFERENCES `supervisors` (`supervisor_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `events`
--

LOCK TABLES `events` WRITE;
/*!40000 ALTER TABLE `events` DISABLE KEYS */;
INSERT INTO `events` VALUES (1,1,'Вибір теми дипломної роботи','2025-04-05 10:00:00','Огляд доступних тем для дипломних робіт','Аудиторія 101','Семінар',90),(2,2,'Захист теми дипломної роботи','2025-04-12 11:00:00','Представлення обраної теми дипломної роботи','Аудиторія 102','Конференція',120),(3,3,'Методологія дослідження','2025-04-15 14:00:00','Основи методології для наукових досліджень','Аудиторія 201','Лекція',60),(4,4,'Робота з науковими джерелами','2025-04-20 09:00:00','Як правильно працювати з науковими статтями','Онлайн','Практика',75),(5,5,'Написання теоретичної частини','2025-04-25 13:00:00','Основи написання першої частини дипломної роботи','Аудиторія 103','Семінар',90),(6,6,'Аналіз даних у дипломній роботі','2025-04-28 16:00:00','Методи обробки та аналізу даних','Онлайн','Практика',120),(7,7,'Оформлення дипломної роботи','2025-05-02 10:00:00','Вимоги до оформлення дипломної роботи','Аудиторія 202','Лекція',60),(8,8,'Практичне використання програмного забезпечення','2025-05-06 15:00:00','Використання інструментів для аналізу даних','Аудиторія 204','Практика',90),(9,9,'Семінар з написання висновків','2025-05-10 11:00:00','Рекомендації щодо підготовки висновків','Онлайн','Семінар',60),(10,10,'Попередній захист дипломної роботи','2025-05-15 09:00:00','Тренувальний захист перед комісією','Аудиторія 301','Конференція',120),(11,11,'Етика наукових досліджень','2025-05-18 14:00:00','Основи академічної доброчесності','Аудиторія 302','Лекція',60),(12,12,'Робота з бібліографією','2025-05-22 16:00:00','Як правильно оформлювати список літератури','Онлайн','Практика',75),(13,13,'Семінар з презентації результатів','2025-05-26 12:00:00','Як ефективно презентувати результати дослідження','Аудиторія 304','Семінар',90),(14,14,'Рецензування дипломної роботи','2025-06-01 09:00:00','Як проходить рецензування дипломних робіт','Аудиторія 305','Конференція',120),(15,15,'Фінальна перевірка роботи','2025-06-04 15:00:00','Остаточний контроль дипломних робіт','Онлайн','Практика',90),(16,16,'Захист дипломної роботи','2025-06-10 10:00:00','Офіційний захист дипломної роботи перед комісією','Аудиторія 401','Конференція',180),(17,17,'Підготовка до питань на захисті','2025-06-12 13:00:00','Типові питання комісії та як на них відповідати','Аудиторія 402','Семінар',90),(18,18,'Грамотне оформлення презентації','2025-06-15 12:00:00','Як створити ефективну презентацію для захисту','Онлайн','Практика',75),(19,19,'Технічний огляд проєктів','2025-06-18 14:00:00','Перевірка програмних рішень у дипломних роботах','Аудиторія 403','Лекція',60),(20,20,'Підведення підсумків дипломного процесу','2025-06-22 11:00:00','Оцінка загального рівня робіт та обговорення проблем','Аудиторія 404','Конференція',120),(21,1,'Дедлайн: Вибір теми та узгодження з керівником','2025-04-05 00:00:01','Вибір теми дипломної роботи та узгодження з керівником. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19504',NULL,'Дедлайн',0),(22,1,'Дедлайн: Критичний аналіз існуючих рішень','2025-04-09 00:00:01','Проведення критичного аналізу існуючих рішень. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19505',NULL,'Дедлайн',0),(23,1,'Дедлайн: Специфікація функціональних вимог до програмної системи','2025-04-19 00:00:01','Розробка специфікації функціональних вимог до програмної системи. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19506',NULL,'Дедлайн',0),(24,1,'Дедлайн: Специфікація нефункціональних вимог до програмної системи','2025-05-03 00:00:01','Розробка специфікації нефункціональних вимог до програмної системи. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19507',NULL,'Дедлайн',0),(25,1,'Дедлайн: Функціональна декомпозиція системи з виділенням модулів','2025-05-09 00:00:01','Розбиття системи на модулі з функціональною декомпозицією. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19508',NULL,'Дедлайн',0),(26,1,'Дедлайн: Динаміка процесів у системі','2025-05-19 00:00:01','Аналіз динаміки процесів у системі. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19509',NULL,'Дедлайн',0),(27,1,'Дедлайн: Розробка ER-моделі системи','2025-05-21 00:00:01','Створення ER-моделі системи. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19510',NULL,'Дедлайн',0),(28,1,'Дедлайн: Логічне проектування обраного модуля: структури даних, алгоритми','2025-05-23 00:00:01','Розробка логічного проектування для структур даних та алгоритмів обраного модуля. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19511',NULL,'Дедлайн',0),(29,1,'Дедлайн оновлено: Логічне проектування обраного модуля: інтерфейс користувача, діаграма класів','2025-06-01 00:07:00','Новий кінцевий термін здачі завдання \"Логічне проектування обраного модуля: інтерфейс користувача, діаграма класів\" встановлено на 01.06.2025, 00:07:00',NULL,'Дедлайн',0),(30,1,'Дедлайн: Програмна реалізація обраного модуля','2025-05-27 00:00:01','Реалізація програмного коду обраного модуля. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19513',NULL,'Дедлайн',0),(31,1,'Дедлайн: Тестування обраного модуля','2025-05-29 00:00:01','Проведення тестування функціональності обраного модуля. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19514',NULL,'Дедлайн',0),(32,1,'Дедлайн: Повністю оформлена пояснювальна записка','2025-06-01 00:00:01','Підготовка та оформлення пояснювальної записки до дипломної роботи. Посилання: https://edu.op.edu.ua/mod/assign/view.php?id=19515',NULL,'Дедлайн',0),(33,5,'Семінар з оформелення протоколу','2025-04-15 09:00:00','Семінар з оформелення протоколу','Онлайн','Семінар',90),(36,1,'Дедлайн: test1','2025-05-11 03:00:00','Закінчується строк здачі завдання: \"test1\"',NULL,'Дедлайн',0),(37,1,'Дедлайн: test1','2025-05-11 03:00:00','Кінцевий термін здачі завдання \"test1\"',NULL,'Дедлайн',60),(38,1,'Дедлайн: Tesssst','2025-04-26 03:00:00','Закінчується строк здачі завдання: \"Tesssst\"',NULL,'Дедлайн',0),(39,1,'Дедлайн: Tesssst','2025-04-26 03:00:00','Кінцевий термін здачі завдання \"Tesssst\"',NULL,'Дедлайн',60),(40,1,'Дедлайн оновлено: Тестування редагування','2025-06-27 05:00:00','Новий кінцевий термін здачі завдання \"Тестування редагування\" встановлено на 27.06.2025, 05:00:00',NULL,'Дедлайн',0),(41,1,'Дедлайн: Tesssst44444.com','2025-04-19 03:00:00','Кінцевий термін здачі завдання \"Tesssst44444.com\"',NULL,'Дедлайн',60),(43,28,'testy','2025-08-03 19:14:00','fdfddffddf','ffff.com','Лекція',90),(44,29,'testy','2025-06-08 19:21:00','testy','ffff.com','Лекція',90),(45,11,'test3333','2025-05-09 19:56:00','ававав','ffff.com','Практика',900000),(46,20,'testy','2025-05-30 03:00:00','Тест','https://us02web.zoom.us/j/7727088072?pwd=U00vaTBIYUlRbzd6YlNZcFdKM1hVdz09','Практика',105);
/*!40000 ALTER TABLE `events` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-31 12:51:00
